Documents/УЧ_ВыплатаЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>УЧ_ВыплатаЗП</Name>
			<BasedOn>
				<xr:Item>Document.УЧ_НачислениеЗП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затраты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеВРазрезеПредприятий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачисленийОплатыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>400</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорПодразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВыплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/УЧ_ВыплатаЗП/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если РучнаяКорректировка Тогда		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Движения документа %1 отредактированы вручную и не могут быть автоматически актуализированы'"), ЭтотОбъект);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.КлючДанных = Ссылка;
		Сообщение.Сообщить();		
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.Учетный.Записывать = Истина;
	
	Для каждого Строка Из ТабличнаяЧасть Цикл
		
		Движение = Движения.Учетный.Добавить();
		Движение.Период = Дата;
		Движение.Предприятия = Предприятие;
		Движение.Содержание = ?(ЗначениеЗаполнено(Строка.Комментарий), Строка.Комментарий, Комментарий);
		Движение.СценарийПлана = Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина);
		
		Движение.СчетДт = СчетСписания;
		Если Движение.СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = Подразделение;
		КонецЕсли;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,Движение.СчетДт,1,Работники);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,Движение.СчетДт,2,Строка.ВидНачисления);
		
		Движение.СчетКт = ПланыСчетов.Учетный.Счет70();
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,Движение.СчетКт,1,Строка.Сотрудник);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,Движение.СчетКт,2,Строка.ВидНачисления);
		Если Движение.СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = Подразделение;
		КонецЕсли;
		
		Движение.Сумма = - Строка.Сумма;
		
	    Движение = Движения.Учетный.Добавить();
		Движение.Период = Дата;
		Движение.Предприятия = Предприятие;
		Движение.Содержание = ?(ЗначениеЗаполнено(Строка.Комментарий), Строка.Комментарий, Комментарий);
		Движение.СценарийПлана = Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина);
		
		Движение.СчетДт = СчетСписания;
		Если Движение.СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = Подразделение;
		КонецЕсли;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,Движение.СчетДт,1,Работники);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,Движение.СчетДт,2,Строка.ВидНачисления);
		
		Движение.СчетКт = ПланыСчетов.Учетный.Счет70();
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,Движение.СчетКт,1,Строка.Сотрудник);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,Движение.СчетКт,2,Строка.ВидНачисления);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,Движение.СчетКт,3,Ссылка);
		Если Движение.СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = Подразделение;
		КонецЕсли;
		
		Движение.Сумма = Строка.Сумма;		
	КонецЦикла;
	//
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = ТабличнаяЧасть.Итог("Сумма");
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	РучнаяКорректировка = Ложь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РучнаяКорректировка = Ложь;
	ДокументОснование = Неопределено;
	
	Для каждого ТекСтрока Из ТабличнаяЧасть Цикл
		ТекСтрока.ДокументВыплаты = Неопределено;	
		ТекСтрока.СуммаВыплачено = 0;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЧ_НачислениеЗП") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УчетныйОстатки.Субконто1 КАК Сотрудник,
		               |	УчетныйОстатки.СуммаОстатокКт КАК СуммаКВыплате,
		               |	УчетныйОстатки.Субконто2 КАК ВидНачисления
		               |ИЗ
		               |	РегистрБухгалтерии.Учетный.Остатки(
		               |			&Дата,
		               |			Счет В (&Счет70),
		               |			,
		               |			Предприятия = &Предприятие
		               |				И Субконто1 В (&Сотрудники)) КАК УчетныйОстатки";
		
		Запрос.УстановитьПараметр("Сотрудники", ДанныеЗаполнения.ТабличнаяЧасть.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		Запрос.УстановитьПараметр("Предприятие", ДанныеЗаполнения.Предприятие);
		Запрос.УстановитьПараметр("Дата", КонецМесяца(ДанныеЗаполнения.Дата));
		Запрос.УстановитьПараметр("Счет70", ПланыСчетов.Учетный.Счет70());
		
		Результат = Запрос.Выполнить();
		ВыборкаЗадолженность = Результат.Выгрузить();		
		
		НачислениеВРазрезеПредприятий = ДанныеЗаполнения.НачислениеВРазрезеПредприятий;
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.Предприятие  = ДанныеЗаполнения.Предприятие;
		ЭтотОбъект.ЮрЛицо = ДанныеЗаполнения.ЮрЛицо;
		ЭтотОбъект.Затраты = ДанныеЗаполнения.Субконто1;
		ЭтотОбъект.Комментарий = ДанныеЗаполнения.Комментарий;
		ЭтотОбъект.Работники = ДанныеЗаполнения.Работники;
		ТЧ = ДанныеЗаполнения.ТабличнаяЧасть.Выгрузить(,"НомерСтроки ,Сотрудник, Предприятие, Подразделение, ВидНачисления, Сумма, КорПодразделение");
		ТЧ.Свернуть("Сотрудник, Предприятие, Подразделение, ВидНачисления, КорПодразделение","Сумма");
		ЭтотОбъект.ТабличнаяЧасть.Загрузить(ТЧ);
		ЭтотОбъект.Подразделение = ДанныеЗаполнения.Подразделение;
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Для каждого ТекСтрока Из ТабличнаяЧасть Цикл
			НайденныеЗадолженности = ВыборкаЗадолженность.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисления", ТекСтрока.Сотрудник, ТекСтрока.ВидНачисления)); 
			Для каждого текНайденная Из НайденныеЗадолженности Цикл
				ТекСтрока.Сумма = текНайденная.СуммаКВыплате;	
			КонецЦикла; 		
			//НайденныеУдержания = ДанныеЗаполнения.Удержания.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисления", ТекСтрока.Сотрудник, ТекСтрока.ВидНачисления));
			//Для каждого текНайденная Из НайденныеУдержания Цикл
			//	ТекСтрока.Сумма = ТекСтрока.Сумма - текНайденная.Сумма;	
			//КонецЦикла; 		
		КонецЦикла; 
		
		//Попытка
		//	ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		//Исключение
		//	Сообщить("Не удалось провести документ. " + ОписаниеОшибки());
		//КонецПопытки;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения = ДанныеЗаполнения.Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	УчетныйОстатки.Субконто1 КАК Сотрудник,
		               |	УчетныйОстатки.СуммаОстатокКт КАК СуммаКВыплате,
		               |	УчетныйОстатки.Субконто2 КАК ВидНачисления
		               |ИЗ
		               |	РегистрБухгалтерии.Учетный.Остатки(&Дата, Счет В (&Счет70), , Предприятия = &Предприятие) КАК УчетныйОстатки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сотрудник";
		
		//Запрос.УстановитьПараметр("Сотрудники", ДанныеЗаполнения.ТабличнаяЧасть.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		Запрос.УстановитьПараметр("Предприятие", ДанныеЗаполнения.Предприятие);
		Запрос.УстановитьПараметр("Дата", КонецМесяца(ДанныеЗаполнения.Дата));
		Запрос.УстановитьПараметр("Счет70", ПланыСчетов.Учетный.Счет70());
		
		Результат = Запрос.Выполнить();
		ВыборкаЗадолженность = Результат.Выгрузить();		
		
		НачислениеВРазрезеПредприятий = ДанныеЗаполнения.НачислениеВРазрезеПредприятий;
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.Предприятие  = ДанныеЗаполнения.Предприятие;
		ЭтотОбъект.ЮрЛицо = ДанныеЗаполнения.ЮрЛицо;
		ЭтотОбъект.Затраты = ДанныеЗаполнения.Субконто1;
		ЭтотОбъект.Комментарий = ДанныеЗаполнения.Комментарий;
		ЭтотОбъект.Работники = ДанныеЗаполнения.Работники;
		//ТЧ = ДанныеЗаполнения.ТабличнаяЧасть.Выгрузить(,"НомерСтроки ,Сотрудник, Предприятие, Подразделение, ВидНачисления, Сумма, КорПодразделение");
		//ТЧ.Свернуть("Сотрудник, Предприятие, Подразделение, ВидНачисления, КорПодразделение","Сумма");
		//ЭтотОбъект.ТабличнаяЧасть.Загрузить(ТЧ);
		ЭтотОбъект.Подразделение = ДанныеЗаполнения.Подразделение;
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Для каждого ТекСтрока Из ВыборкаЗадолженность Цикл
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			//НайденныеЗадолженности = ВыборкаЗадолженность.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисления", ТекСтрока.Сотрудник, ТекСтрока.ВидНачисления)); 
			//Для каждого текНайденная Из НайденныеЗадолженности Цикл
				НоваяСтрока.Сумма = ТекСтрока.СуммаКВыплате;	
			//КонецЦикла; 		
			//НайденныеУдержания = ДанныеЗаполнения.Удержания.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисления", ТекСтрока.Сотрудник, ТекСтрока.ВидНачисления));
			//Для каждого текНайденная Из НайденныеУдержания Цикл
			//	ТекСтрока.Сумма = ТекСтрока.Сумма - текНайденная.Сумма;	
			//КонецЦикла; 		
		КонецЦикла;	
		
	КонецЕсли;
	
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаЗаполненияСФормы(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт

	ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	

КонецПроцедуры
